{
    "vision": "To establish a spiritual and cultural epicenter in Morbi, Gujarat, that:\n• Honors our motherland through the world's largest Bharat Mata Temple.\n• Revives ancient Indian wisdom through a modern Gurukul system.\n• Becomes a global beacon for nationalism and Sanatan Dharma values.\n• Preserves and propagates the principles of Arya Samaj for contemporary society.",
    "mission": "1. Temple Development\n• Construct the world's largest Bharat Mata Temple, symbolizing national pride and devotion.\n• Create a sacred space uniting all Indians in reverence for our motherland.\n\n2. Gurukul Education\n• Establish a state-of-the-art Gurukul blending Vedic knowledge with modern education.\n• Develop future leaders deeply rooted in Indian culture, values, and nationalism.\n• Offer residential programs focusing on character building, discipline, and spirituality.\n\n3. Cultural Preservation\n• Promote Arya Samaj principles through daily rituals, discourses, and community programs.\n• Organize nationalist and cultural events celebrating India's heritage and pride.\n• Create a living museum showcasing India's spiritual and freedom struggle history.\n\n4. Community Engagement\n• Conduct youth programs to instill patriotism and social responsibility.\n• Offer free classes in Sanskrit, Vedic mathematics, and Indian philosophy.\n• Develop outreach programs to schools and colleges across Gujarat.\n\n5. National Integration\n• Host interfaith dialogues promoting unity in diversity.\n• Celebrate Indian festivals with traditional fervor and cultural significance.\n• Create platforms showcasing India's rich cultural and spiritual legacy.",
    "values": "• Nationalism – Fostering love for Bharat and its cultural heritage.\n• Spirituality – Promoting Sanatan Dharma and Arya Samaj principles.\n• Education – Blending ancient wisdom with modern knowledge.\n• Service – Encouraging selfless contribution to society and nation-building.\n• Unity – Bringing people together beyond caste, creed, and religion."
}
